python/15.logging.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>日志</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">日志</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdb3dad8">1. logging</a>
<ul>
<li><a href="#orge27f3e0">1.1. 日志配置文件 logging.conf</a></li>
<li><a href="#org7d09665">1.2. 配置格式化属性名称</a></li>
<li><a href="#org497d26e">1.3. 使用指南</a></li>
</ul>
</li>
<li><a href="#org134a024">2. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdb3dad8" class="outline-2">
<h2 id="orgdb3dad8"><span class="section-number-2">1</span> logging</h2>
<div class="outline-text-2" id="text-1">
<p>
记录日志是程序员比较常见的需求， Python3.x 提供了 logging 模块来满足程序记录日志
的基本功能。
</p>
</div>

<div id="outline-container-orge27f3e0" class="outline-3">
<h3 id="orge27f3e0"><span class="section-number-3">1.1</span> 日志配置文件 logging.conf</h3>
<div class="outline-text-3" id="text-1-1">
<p>
我比较偏爱使用配置文件来配置日志的属性，这样方便不修改程序来动态改日志记录级别。
下面是我配置日志的一个配置文件。
</p>

<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #268bd2;">loggers</span>]
<span style="color: #6c71c4;">keys</span>=root,sample

[<span style="color: #268bd2;">handlers</span>]
<span style="color: #6c71c4;">keys</span>=console,debug,info,error

[<span style="color: #268bd2;">formatters</span>]
<span style="color: #6c71c4;">keys</span>=simple,detail

[<span style="color: #268bd2;">logger_root</span>]
<span style="color: #6c71c4;">level</span>=DEBUG
<span style="color: #6c71c4;">handlers</span>=debug,error

[<span style="color: #268bd2;">logger_sample</span>]
<span style="color: #6c71c4;">level</span>=DEBUG
<span style="color: #6c71c4;">handlers</span>=console,info
<span style="color: #6c71c4;">qualname</span>=sample

[<span style="color: #268bd2;">handler_console</span>]
<span style="color: #6c71c4;">class</span>=StreamHandler
<span style="color: #6c71c4;">level</span>=DEBUG
<span style="color: #6c71c4;">formatter</span>=simple
<span style="color: #6c71c4;">args</span>=(sys.stdout,)

[<span style="color: #268bd2;">handler_debug</span>]
<span style="color: #6c71c4;">class</span>=logging.handlers.TimedRotatingFileHandler
<span style="color: #6c71c4;">level</span>=DEBUG
<span style="color: #6c71c4;">formatter</span>=simple
<span style="color: #6c71c4;">backupCount</span>=10
<span style="color: #6c71c4;">encoding</span>=utf8
<span style="color: #6c71c4;">args</span>=(<span style="color: #2aa198;">"log/debug.log"</span>,)

[<span style="color: #268bd2;">handler_info</span>]
<span style="color: #6c71c4;">class</span>=logging.handlers.TimedRotatingFileHandler
<span style="color: #6c71c4;">level</span>=INFO
<span style="color: #6c71c4;">formatter</span>=simple
<span style="color: #6c71c4;">backupCount</span>=10
<span style="color: #6c71c4;">encoding</span>=utf8
<span style="color: #6c71c4;">args</span>=(<span style="color: #2aa198;">"log/info.log"</span>,)

[<span style="color: #268bd2;">handler_error</span>]
<span style="color: #6c71c4;">class</span>=logging.handlers.TimedRotatingFileHandler
<span style="color: #6c71c4;">level</span>=WARNING
<span style="color: #6c71c4;">formatter</span>=detail
<span style="color: #6c71c4;">backupCount</span>=10
<span style="color: #6c71c4;">encoding</span>=utf8
<span style="color: #6c71c4;">args</span>=(<span style="color: #2aa198;">"log/error.log"</span>,)

[<span style="color: #268bd2;">formatter_simple</span>]
<span style="color: #6c71c4;">format</span>=[%(asctime)s][%(levelname)-8s] &lt;%(name)s&gt;: %(message)s
<span style="color: #6c71c4;">datefmt</span>=

[<span style="color: #268bd2;">formatter_detail</span>]
<span style="color: #6c71c4;">format</span>=[%(asctime)s][%(levelname)-8s][%(filename)s:%(lineno)d:%(funcName)s()] &lt;%(name)s&gt;: %(message)s
<span style="color: #6c71c4;">datefmt</span>=
</pre>
</div>

<p>
这里的日志将分配记录到程序目录的 log 文件夹下。
</p>
</div>
</div>

<div id="outline-container-org7d09665" class="outline-3">
<h3 id="org7d09665"><span class="section-number-3">1.2</span> 配置格式化属性名称</h3>
<div class="outline-text-3" id="text-1-2">
<p>
配置的格式化属性参考下面的表格，请需要注意的是 args 不要自己编辑。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Attribute name</th>
<th scope="col" class="org-left">Format</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">args</td>
<td class="org-left">You shouldn’t need to format this yourself.</td>
<td class="org-left">The tuple of arguments merged into msg to produce message, or a dict whose values are used for the merge (when there is only one argument, and it is a dictionary).</td>
</tr>

<tr>
<td class="org-left">asctime</td>
<td class="org-left">%(asctime)s</td>
<td class="org-left">Human-readable time when the LogRecord was created. By default this is of the form ‘2003-07-08 16:49:45,896’ (the numbers after the comma are millisecond portion of the time).</td>
</tr>

<tr>
<td class="org-left">created</td>
<td class="org-left">%(created)f</td>
<td class="org-left">Time when the LogRecord was created (as returned by time.time()).</td>
</tr>

<tr>
<td class="org-left">exc<sub>info</sub></td>
<td class="org-left">You shouldn’t need to format this yourself.</td>
<td class="org-left">Exception tuple (à la sys.exc<sub>info</sub>) or, if no exception has occurred, None.</td>
</tr>

<tr>
<td class="org-left">filename</td>
<td class="org-left">%(filename)s</td>
<td class="org-left">Filename portion of pathname.</td>
</tr>

<tr>
<td class="org-left">funcName</td>
<td class="org-left">%(funcName)s</td>
<td class="org-left">Name of function containing the logging call.</td>
</tr>

<tr>
<td class="org-left">levelname</td>
<td class="org-left">%(levelname)s</td>
<td class="org-left">Text logging level for the message ('DEBUG', 'INFO', 'WARNING', 'ERROR', 'CRITICAL').</td>
</tr>

<tr>
<td class="org-left">levelno</td>
<td class="org-left">%(levelno)s</td>
<td class="org-left">Numeric logging level for the message (DEBUG, INFO, WARNING, ERROR, CRITICAL).</td>
</tr>

<tr>
<td class="org-left">lineno</td>
<td class="org-left">%(lineno)d</td>
<td class="org-left">Source line number where the logging call was issued (if available).</td>
</tr>

<tr>
<td class="org-left">message</td>
<td class="org-left">%(message)s</td>
<td class="org-left">The logged message, computed as msg % args. This is set when Formatter.format() is invoked.</td>
</tr>

<tr>
<td class="org-left">module</td>
<td class="org-left">%(module)s</td>
<td class="org-left">Module (name portion of filename).</td>
</tr>

<tr>
<td class="org-left">msecs</td>
<td class="org-left">%(msecs)d</td>
<td class="org-left">Millisecond portion of the time when the LogRecord was created.</td>
</tr>

<tr>
<td class="org-left">msg</td>
<td class="org-left">You shouldn’t need to format this yourself.</td>
<td class="org-left">The format string passed in the original logging call. Merged with args to produce message, or an arbitrary object (see Using arbitrary objects as messages).</td>
</tr>

<tr>
<td class="org-left">name</td>
<td class="org-left">%(name)s</td>
<td class="org-left">Name of the logger used to log the call.</td>
</tr>

<tr>
<td class="org-left">pathname</td>
<td class="org-left">%(pathname)s</td>
<td class="org-left">Full pathname of the source file where the logging call was issued (if available).</td>
</tr>

<tr>
<td class="org-left">process</td>
<td class="org-left">%(process)d</td>
<td class="org-left">Process ID (if available).</td>
</tr>

<tr>
<td class="org-left">processName</td>
<td class="org-left">%(processName)s</td>
<td class="org-left">Process name (if available).</td>
</tr>

<tr>
<td class="org-left">relativeCreated</td>
<td class="org-left">%(relativeCreated)d</td>
<td class="org-left">Time in milliseconds when the LogRecord was created, relative to the time the logging module was loaded.</td>
</tr>

<tr>
<td class="org-left">stack<sub>info</sub></td>
<td class="org-left">You shouldn’t need to format this yourself.</td>
<td class="org-left">Stack frame information (where available) from the bottom of the stack in the current thread, up to and including the stack frame of the logging call which resulted in the creation of this record.</td>
</tr>

<tr>
<td class="org-left">thread</td>
<td class="org-left">%(thread)d</td>
<td class="org-left">Thread ID (if available).</td>
</tr>

<tr>
<td class="org-left">threadName</td>
<td class="org-left">%(threadName)s</td>
<td class="org-left">Thread name (if available).</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org497d26e" class="outline-3">
<h3 id="org497d26e"><span class="section-number-3">1.3</span> 使用指南</h3>
<div class="outline-text-3" id="text-1-3">
<p>
使用的时候需要初始化日志类，参考代码如下：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> logging.config
logging.config.fileConfig<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'logging.conf'</span><span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
初始化过后就可以记录日志了，这样记录日志方法可以是直接记录，也可以在类里面记录。
下面是常用的记录方法：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900;">import</span> logging

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">logging directly</span>
<span style="color: #6c71c4;">logger</span> = logging.getLogger<span style="color: #8d5649;">(</span><span style="color: #6c71c4;">__name__</span><span style="color: #8d5649;">)</span>
logging.info<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"..."</span><span style="color: #8d5649;">)</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">logging in Class</span>
<span style="color: #859900;">class</span> <span style="color: #268bd2;">Hello</span>:

  <span style="color: #859900;">def</span> <span style="color: #b58900;">__init__</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">self</span>.logger = logging.getLogger<span style="color: #8d5649;">(</span><span style="color: #6c71c4;">__name__</span><span style="color: #8d5649;">)</span>

  <span style="color: #859900;">def</span> <span style="color: #b58900;">hello</span><span style="color: #8d5649;">(</span><span style="color: #859900;">self</span><span style="color: #8d5649;">)</span>:
    <span style="color: #859900;">self</span>.info<span style="color: #8d5649;">(</span><span style="color: #2aa198;">"..."</span><span style="color: #8d5649;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org134a024" class="outline-2">
<h2 id="org134a024"><span class="section-number-2">2</span> 参考链接</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://github.com/Jeanhwea/python-project-template">Python Project Template</a></li>
<li><a href="https://docs.python.org/3/library/logging.html#logrecord-attributes%0A">logging formatter</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-30 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:48</p>
</div>
</body>
</html>
